# pandas in python

In [4]:
import pandas as pd

# Introduction to pandas and structure

pandas has usually has  two data structure:- "series" and "data frames"

In [5]:
ser=pd.Series(data=[100,200,300,400,500], index=['a','b','c','d','e'])
ser

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [6]:
ser.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
ser['a']

100

In [10]:
ser[[4,3,1]]

e    500
d    400
b    200
dtype: int64

In [14]:
'e' in ser  # only index

True

In [15]:
ser*2

a     200
b     400
c     600
d     800
e    1000
dtype: int64

In [16]:
ser**2   #square value 2 power 2

a     10000
b     40000
c     90000
d    160000
e    250000
dtype: int64

# pandas data frames

In [ ]:
combination of two seres

In [26]:
d={'one' :pd.Series([100,200,300],index=['a','b','c']),
   'two':pd.Series([900,800,700.,600.],index=['a','b','c','d'])}
df=pd.DataFrame(d)
print(df)

     one    two
a  100.0  900.0
b  200.0  800.0
c  300.0  700.0
d    NaN  600.0

In [28]:
df.columns

Index(['one', 'two'], dtype='object')

In [30]:
pd.DataFrame(d,index=['a','c','d'])

     one    two
a  100.0  900.0
c  300.0  700.0
d    NaN  600.0

# python dictionaries

In [38]:
data=[{'a':1,'b':2},{'x':100,'y':200,'z':300}]
pd.DataFrame(data)

     a    b      x      y      z
0  1.0  2.0    NaN    NaN    NaN
1  NaN  NaN  100.0  200.0  300.0

In [42]:
pd.DataFrame(data,columns=['z','a','apple'])

       z    a  apple
0    NaN  1.0    NaN
1  300.0  NaN    NaN

In [41]:
df

     one    two
a  100.0  900.0
b  200.0  800.0
c  300.0  700.0
d    NaN  600.0

# Basic datafreames operation

In [43]:
df

     one    two
a  100.0  900.0
b  200.0  800.0
c  300.0  700.0
d    NaN  600.0

In [45]:
df['one']

a    100.0
b    200.0
c    300.0
d      NaN
Name: one, dtype: float64

In [46]:
df['three']=df['one']*df['two']
df

     one    two     three
a  100.0  900.0   90000.0
b  200.0  800.0  160000.0
c  300.0  700.0  210000.0
d    NaN  600.0       NaN

In [47]:
df['greater']=df['one']>250
df

     one    two     three  greater
a  100.0  900.0   90000.0    False
b  200.0  800.0  160000.0    False
c  300.0  700.0  210000.0     True
d    NaN  600.0       NaN    False

In [52]:
df

     one    two  greater
a  100.0  900.0    False
b  200.0  800.0    False
c  300.0  700.0     True
d    NaN  600.0    False

In [53]:
three

a     90000.0
b    160000.0
c    210000.0
d         NaN
Name: three, dtype: float64

In [1]:
#del df['two'] # delet

In [57]:
df

     one  greater
a  100.0    False
b  200.0    False
c  300.0     True
d    NaN    False

In [58]:
df.insert(0,'copy_one',df['one'])
df

   copy_one    one  greater
a     100.0  100.0    False
b     200.0  200.0    False
c     300.0  300.0     True
d       NaN    NaN    False

In [65]:
df['one_upper_half']=df['one'][:2]
df

   copy_one    one copy_three  greater  one_upper_half
a     100.0  100.0      three    False           100.0
b     200.0  200.0      three    False           200.0
c     300.0  300.0      three     True             NaN
d       NaN    NaN      three    False             NaN

In [69]:
movies=pd.read_csv('C:/Users/lenovo/Desktop/datasets/movies.csv',sep=',')
print(type(movies))
movies.head() #upper 5 rows

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [8]:
import pandas as pd
movies=pd.read_csv('C:/Users/lenovo/Desktop/datasets/movies.csv',sep=',')
print(type(movies))
movies.tail(10)

<class 'pandas.core.frame.DataFrame'>

       movieId                           title                  genres
62413   209145                  Liberté (2019)                   Drama
62414   209147     The Carpet of Horror (1962)            Crime|Horror
62415   209151          Mao Zedong 1949 (2019)      (no genres listed)
62416   209153             Happy Flight (2008)            Comedy|Drama
62417   209155      Santosh Subramaniam (2008)   Action|Comedy|Romance
62418   209157                       We (2018)                   Drama
62419   209159       Window of the Soul (2001)             Documentary
62420   209163                Bad Poems (2018)            Comedy|Drama
62421   209169             A Girl Thing (2001)      (no genres listed)
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama

In [ ]:
import pandas as pd
tags=pd.read_csv('C:/Users/lenovo/Desktop/datasets/tags.csv',sep=',')
print(type(tags))
tags.head()

In [ ]:
import pandas as pd
rate=pd.read_csv('C:/Users/lenovo/Desktop/datasets/ratings.csv',sep=',')
print(type(rate))
rate.head()

In [ ]:
tags.head()

In [ ]:
tags.colums